{"threads":[{"posts":[{"no":2,"com":"what went wrong?","name":"Anonymous","time":1666678604,"omitted_posts":0,"omitted_images":0,"replies":0,"images":0,"sticky":0,"locked":0,"cyclical":"0","last_modified":1666678604,"tn_h":243,"tn_w":255,"h":1138,"w":1192,"fsize":683763,"filename":"Screenshot 2022-10-25 at 02.16.26","ext":".png","tim":"1666678604388","md5":"moW3j2MR6sIdFanoNHAxSw==","resto":0}]},{"posts":[{"no":1,"sub":"Kouro Network Development log","com":"hi its cow 🐮  here and today I have some exciting news, some exclusive images from the development of the kouros NFT and more, I will be posting things about the development in this image board.<br\/><br\/>to be honest I&#039;m not a big fan of discord so I rather this community uses either twitter or this image board + the wiki. I don&#039;t think we will need a forum.<br\/><br\/>I have been developing a small RPG game with some online functionalities such as chat and co-op. the screenshot I posted is the title screen, the game will be the main page for the mint and you will mint the Kouros directly from the game menu!<br\/><br\/>I have created the wiki and added some of the lore to it. I have been creating the lore for kouros for months, I think the lore and the art have walked together as we decided how we wanted Kouros to look like.<br\/><br\/>As on-chain guardians having the option to soulbond your Kouros seems natural to me. As a free mint , to dive deeper into the community and lore you can take the step further. In the future we will use GOOnomics and give tokens as incentive.<br\/><br\/>The game will probably come at launch day with a few features such as co-op and chat function, probably not many web3 functions will exist in the game at launch, we still haven&#039;t decided how we want the game to impact the NFT and honest we have the community to help decide this.<br\/><br\/>I have been working day and night on this, which will be the second drop for my project the movers, we first did the Yogurt Maker and now Kouros, (shout out to early Milky Pass owners!!! I LOVE YOU!)<br\/><br\/>Any questions etc pls comment, I will be using this same thread for more posts!<br\/><br\/>WIKI: <a href=\"https:\/\/wiki.kouros.network\" rel=\"nofollow\" target=\"_blank\">https:\/\/wiki.kouros.network<\/a><br\/>6ixthchan: <a href=\"https:\/\/6ixthchan.kouros.network\" rel=\"nofollow\" target=\"_blank\">https:\/\/6ixthchan.kouros.network<\/a>","name":"cow","trip":"!i.S1y5MwK.","time":1666678300,"omitted_posts":0,"omitted_images":0,"replies":0,"images":0,"sticky":0,"locked":0,"cyclical":"0","last_modified":1666678300,"tn_h":210,"tn_w":255,"h":1528,"w":1856,"fsize":2849345,"filename":"Screenshot 2022-10-24 at 22.40.14","ext":".png","tim":"1666678300117","md5":"sVRr\/PhdZ\/OBlvfKkFRFag==","resto":0}]}]}