{"posts":[{"no":2,"sub":"hi im Presley! AMA","com":"ask me anything","name":"Anonymous","time":1666394902,"omitted_posts":0,"omitted_images":0,"sticky":0,"locked":0,"cyclical":"0","last_modified":1666458350,"tn_h":255,"tn_w":143,"h":2048,"w":1152,"fsize":302240,"filename":"FfNqNn3XwAAI4QY","ext":".jpeg","tim":"1666394901958","md5":"RDlGqSxzOcPKC9dR52IiXA==","resto":0},{"no":3,"resto":2,"com":"whats the song u been replaying lately?","name":"Anonymous","time":1666395513,"sticky":0,"locked":0,"cyclical":"0","last_modified":1666395513},{"no":4,"resto":2,"sub":"PRESLEY FOR PRES","com":"My (24F) Boyfriend (27M) will not stop calling his cum &quot;Greggnog&quot; During Christmas time<br\/>First off: I am not joking. I wish I was joking.<br\/><br\/>I&#039;ve been with my wonderful boyfriend Greg for over 4 years now, and this Christmas will be our third spent together. He&#039;s so much fun to be around, handsome, charming, and our sex life is great. Except for one small problem.<br\/><br\/>Every year now starting in December he starts referring to his cum as &quot;Greggnog.&quot; When I first heard him say this, it was in the context of a joke, so I laughed, and then I forgot about it. A few days after this, we&#039;re exchanging some spicy texts before he gets home from work he says to me, in all seriousness, &quot;I can&#039;t wait to pour Greggnog all over your face.&quot; I could not believe he just said that to me, but I didn&#039;t know what else to do at the time but go along with it.<br\/><br\/>Fast forward to this December. This phrase re-enters his vocabulary at the same time every year. It makes me cringe beyond belief, but until this year he used it sparingly enough for me to just be able to laugh and say &quot;shut the fuck up.&quot;<br\/><br\/>I&#039;m sure that 2020 has done at least some irreparable psychic damage to all people, but unfortunately, for my boyfriend, this has manifested in the form of him referring to his cum as &quot;Greggnog&quot; non-stop. This month he has been using the term almost exclusively, in all contexts, and it is driving me batshit insane. I sat him down to talk last week, and I asked him very clearly and directly to stop. At the time, he said he would, and it did slow down for a few days, but it is now days before Christmas and he&#039;s back at it again with no end in sight.<br\/><br\/>He absolutely means the world to me, and I saw myself spending the rest of my life with him, but I have serious doubts now whether or not I can if every Christmas is going to be like this. So please, reddit, what do I do to make this stop for good?","email":"spymilk.eth@gmail.com","name":"spymilk","time":1666396579,"sticky":0,"locked":0,"cyclical":"0","last_modified":1666396579},{"no":7,"resto":2,"com":"<a onclick=\"highlightReply('4', event);\" href=\"\/egirl\/res\/2.html#4\">&gt;&gt;4<\/a><br\/>hi spycum","name":"Anonymous","time":1666396852,"sticky":0,"locked":0,"cyclical":"0","last_modified":1666396852},{"no":16,"resto":2,"sub":"Greggnog","com":"Ho Ho Ho, Merry Gregmas!","name":"Greg","time":1666399855,"sticky":0,"locked":0,"cyclical":"0","last_modified":1666399855},{"no":17,"resto":2,"com":"<a onclick=\"highlightReply('16', event);\" href=\"\/egirl\/res\/2.html#16\">&gt;&gt;16<\/a><br\/>its really him","name":"Anonymous","time":1666400400,"sticky":0,"locked":0,"cyclical":"0","last_modified":1666400400,"tn_h":255,"tn_w":222,"h":1004,"w":874,"fsize":779706,"filename":"Screenshot 2022-10-19 at 06.39.27","ext":".png","tim":"1666400400196","md5":"v5ESuOJlabS0EkvhuVSAzQ=="},{"no":18,"resto":2,"com":"eurocbull1 saved my life. 1 day my cat almost died and he brought her back to life. WHAT A CHAD. c","name":"Anonymous","time":1666458350,"sticky":0,"locked":0,"cyclical":"0","last_modified":1666458350}]}